# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.postgres_server.data.azurerm_virtual_network.hub: Reading...
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_client_config.hub: Reading...
data.azurerm_private_dns_zone.postgres: Reading...
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_client_config.hub: Reading...
module.rbac.data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_resource_group.hub: Reading...
module.appsettings.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.postgres_server.data.azurerm_client_config.current: Reading...
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_client_config.current: Reading...
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Reading...
module.rbac.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_user_assigned_identity.admin: Reading...
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_resource_group.spoke: Reading...
module.rbac.data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod]
data.azurerm_subnet.default: Reading...
data.azurerm_subnet.postgres: Reading...
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod]
module.key_vault.data.azurerm_private_dns_zone.key_vault: Reading...
data.azurerm_private_dns_zone.postgres: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
module.postgres_server.data.azurerm_virtual_network.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod]
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
data.azurerm_subnet.default: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001prod/subnets/Default]
module.key_vault.data.azurerm_resource_group.key_vault: Reading...
data.azurerm_subnet.postgres: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001prod/subnets/Postgres]
module.key_vault.data.azurerm_resource_group.key_vault: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauthregister001prod]
data.azurerm_user_assigned_identity.admin: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001prod]
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.OperationalInsights/workspaces/logdwhaltinnauth001prod]
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001prod]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001prod]
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.postgres_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_app" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauthregister001prod/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001prod"
      + name                    = "db-psqlsrvaltinnauthregister001prod-register-app"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.postgres_migration will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_migration" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauthregister001prod/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001prod"
      + name                    = "db-psqlsrvaltinnauthregister001prod-register-migrator"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # null_resource.bootstrap_database must be replaced
-/+ resource "null_resource" "bootstrap_database" {
      ~ id       = "2353707095425839014" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "ts" = "2025-03-04T15:31:04Z" -> (known after apply)
        }
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Altinn:Npgsql:register:ConnectionString_prod-register"] will be created
  + resource "azurerm_app_configuration_key" "key_vault_reference" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Altinn:Npgsql:register:ConnectionString"
      + label                  = "prod-register"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Altinn:Npgsql:register:Migrate:ConnectionString_prod-register"] will be created
  + resource "azurerm_app_configuration_key" "key_vault_reference" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Altinn:Npgsql:register:Migrate:ConnectionString"
      + label                  = "prod-register"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:AppConnectionString_prod-register"] will be destroyed
  # (because key ["Postgres:AppConnectionString_prod-register"] is not in for_each map)
  - resource "azurerm_app_configuration_key" "key_vault_reference" {
      - configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub" -> null
      - content_type           = "application/vnd.microsoft.appconfig.keyvaultref+json;charset=utf-8" -> null
      - etag                   = "MeDej1rCvj_fZnOjVIwylA6Og8oMfEIwrp1DK4WrthA" -> null
      - id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Postgres:AppConnectionString?label=prod-register" -> null
      - key                    = "Postgres:AppConnectionString" -> null
      - label                  = "prod-register" -> null
      - locked                 = false -> null
      - type                   = "vault" -> null
      - value                  = jsonencode(
            {
              - uri = "https://kvregaltinnauth001prod.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001prod-register-app"
            }
        ) -> null
      - vault_key_reference    = "https://kvregaltinnauth001prod.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001prod-register-app" -> null
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:MigrationConnectionString_prod-register"] will be destroyed
  # (because key ["Postgres:MigrationConnectionString_prod-register"] is not in for_each map)
  - resource "azurerm_app_configuration_key" "key_vault_reference" {
      - configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub" -> null
      - content_type           = "application/vnd.microsoft.appconfig.keyvaultref+json;charset=utf-8" -> null
      - etag                   = "a8MF7HbMT2hTMEpJop1RJA16d-xZhKbFpdVfQBslVUY" -> null
      - id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Postgres:MigrationConnectionString?label=prod-register" -> null
      - key                    = "Postgres:MigrationConnectionString" -> null
      - label                  = "prod-register" -> null
      - locked                 = false -> null
      - type                   = "vault" -> null
      - value                  = jsonencode(
            {
              - uri = "https://kvregaltinnauth001prod.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001prod-register-migrator"
            }
        ) -> null
      - vault_key_reference    = "https://kvregaltinnauth001prod.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001prod-register-migrator" -> null
    }

  # module.key_vault.azurerm_private_endpoint.key_vault will be updated in-place
  ~ resource "azurerm_private_endpoint" "key_vault" {
        id                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauthregister001prod/providers/Microsoft.Network/privateEndpoints/pepkvregaltinnauth001prod"
        name                          = "pepkvregaltinnauth001prod"
        tags                          = {}
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauthregister001prod/providers/Microsoft.Network/privateEndpoints/pepkvregaltinnauth001prod/privateDnsZoneGroups/privatelink.vaultcore.azure.net"
            name                 = "privatelink.vaultcore.azure.net"
          ~ private_dns_zone_ids = [
              + "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

        # (1 unchanged block hidden)
    }

  # module.postgres_server.azurerm_management_lock.postgres will be created
  + resource "azurerm_management_lock" "postgres" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "Terraform Managed Lock"
      + notes      = "Prevents unauthorized users from deleting the Postgres server."
      + scope      = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauthregister001prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthregister001prod"
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "postgres_server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauthregister001prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthregister001prod"
        name                              = "psqlsrvaltinnauthregister001prod"
      ~ sku_name                          = "B_Standard_B1ms" -> "B_Standard_B2s"
        tags                              = {}
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgres_server.random_password.pass must be replaced
-/+ resource "random_password" "pass" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "trigger" = "2025-03-04T15:28:15Z" -> (known after apply)
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `src/apps/Altinn.Register/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/altinn.register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_altinn.register.tfstate.tfplan`